class Urls:
    MAIN_PAGE = 'https://qa-scooter.praktikum-services.ru/'
    ORDER_PAGE = 'https://qa-scooter.praktikum-services.ru/order'


class OrderData:
    NAME = 'Иван'
    SURNAME = 'Петров'
    ADDRESS = 'Улица Калинина, 12'
    METRO = 'Сокольники'
    PHONE = '7916125125124'
    DELIVERY_DATE = '01.09.2024'
    RENT_TIME = 'сутки'

    NAME_1 = 'Виктор'
    SURNAME_1 = 'Сидоров'
    ADDRESS_1 = 'Проспект Мира, 100'
    METRO_1 = 'Чистые пруды'
    PHONE_1 = '+791612512512'
    DELIVERY_DATE_1 = '31.08.2024'
    RENT_TIME_1 = 'двое суток'

class QuestionData:
    ANSWER_0_TEXT = 'Сутки — 400 рублей. Оплата курьеру — наличными или картой.'
    ANSWER_1_TEXT = 'Пока что у нас так: один заказ — один самокат. Если хотите покататься с друзьями, можете просто сделать несколько заказов — один за другим.'
    ANSWER_2_TEXT = 'Допустим, вы оформляете заказ на 8 мая. Мы привозим самокат 8 мая в течение дня. Отсчёт времени аренды начинается с момента, когда вы оплатите заказ курьеру. Если мы привезли самокат 8 мая в 20:30, суточная аренда закончится 9 мая в 20:30.'
    ANSWER_3_TEXT = 'Только начиная с завтрашнего дня. Но скоро станем расторопнее.'
    ANSWER_4_TEXT = 'Пока что нет! Но если что-то срочное — всегда можно позвонить в поддержку по красивому номеру 1010.'
    ANSWER_5_TEXT = 'Самокат приезжает к вам с полной зарядкой. Этого хватает на восемь суток — даже если будете кататься без передышек и во сне. Зарядка не понадобится.'
    ANSWER_6_TEXT = 'Да, пока самокат не привезли. Штрафа не будет, объяснительной записки тоже не попросим. Все же свои.'
    ANSWER_7_TEXT = 'Да, обязательно. Всем самокатов! И Москве, и Московской области.'